src/Documents/ИТСервисы_РесурсныйДоговор/ИТСервисы_РесурсныйДоговор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_РесурсныйДоговор</name>
  <registerRecords>AccumulationRegister.ИТСервисы_ДвижениеРесурсовСервисов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Назначения</name>
    <attributes>
      <name>ИТСервис</name>
      <type>
        <types>CatalogRef.ИТСервисы_ИТСервисы</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.ИТСервисы_РолиВПроектах</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентЗанятости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаЧаса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ИТСервисы_ДвижениеРесурсовСервисов/ИТСервисы_ДвижениеРесурсовСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИТСервисы_ДвижениеРесурсовСервисов</name>
  <resources>
    <name>ПроцентЗанятости</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧасовВМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.ИТСервисы_РолиВПроектах</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ИТСервисы_РесурсныйДоговор/ObjectModule.bsl
// Модуль объекта документа ИТСервисы_НазначениеРесурсаНаСервис

// ==========================================
// ОБРАБОТКА ПРОВЕДЕНИЯ
// ==========================================
Процедура ОбработкаПроведения(Отказ, Режим)

	// Инициализируем набор записей
	Движения.ИТСервисы_ДвижениеРесурсовСервисов.Записывать = Истина;
	
	// Очищаем старые движения перед записью новых (стандартный механизм платформы делает это сам, 
	// но явное указание помогает при отладке и нестандартных ситуациях)
	Движения.ИТСервисы_ДвижениеРесурсовСервисов.Очистить();

	Для Каждого СтрТЧ Из Назначения Цикл

		// 1. Пропускаем некорректные строки
		Если НЕ ЗначениеЗаполнено(СтрТЧ.ИТСервис) 
		   ИЛИ НЕ ЗначениеЗаполнено(СтрТЧ.Роль) 
		   ИЛИ СтрТЧ.ПроцентЗанятости <= 0 Тогда
			Продолжить;
		КонецЕсли;

		// 2. Рассчитываем ресурсы
		ЧасовВМесяц = 160 * СтрТЧ.ПроцентЗанятости / 100;

		// 3. Формируем движение ПРИХОД (Начало участия в проекте)
		Движение = Движения.ИТСервисы_ДвижениеРесурсовСервисов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаНачала;
		
		// Измерения
		Движение.ИТСервис = СтрТЧ.ИТСервис;
		Движение.Сотрудник = Сотрудник; // Из шапки
		Движение.Роль = СтрТЧ.Роль;
		
		// Ресурсы
		Движение.ПроцентЗанятости = СтрТЧ.ПроцентЗанятости;
		Движение.ЧасовВМесяц = ЧасовВМесяц;

		// 4. Формируем движение РАСХОД (Если известна дата окончания)
		Если ЗначениеЗаполнено(ДатаОкончания) Тогда
			ДвижениеРасход = Движения.ИТСервисы_ДвижениеРесурсовСервисов.Добавить();
			ДвижениеРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеРасход.Период = ДатаОкончания;
			
			// Измерения
			ДвижениеРасход.ИТСервис = СтрТЧ.ИТСервис;
			ДвижениеРасход.Сотрудник = Сотрудник;
			ДвижениеРасход.Роль = СтрТЧ.Роль;
			
			// Ресурсы
			ДвижениеРасход.ПроцентЗанятости = СтрТЧ.ПроцентЗанятости;
			ДвижениеРасход.ЧасовВМесяц = ЧасовВМесяц;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// ==========================================
// ОБРАБОТКА ПРОВЕРКИ ЗАПОЛНЕНИЯ
// ==========================================
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// 1. Проверка дат
	Если ЗначениеЗаполнено(ДатаОкончания) И ДатаОкончания < ДатаНачала Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата окончания не может быть раньше даты начала!";
		Сообщение.Поле = "ДатаОкончания";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;

	// 2. Проверка строк табличной части
	Индекс = 0;
	СуммаПроцентовДокумента = 0;

	Для Каждого СтрТЧ Из Назначения Цикл

		// Проверка ИТ-Сервиса
		Если НЕ ЗначениеЗаполнено(СтрТЧ.ИТСервис) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнен ИТ-сервис!";
			Сообщение.Поле = "Назначения[" + Формат(Индекс, "ЧГ=0") + "].ИТСервис";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;

		// Проверка Роли
		Если НЕ ЗначениеЗаполнено(СтрТЧ.Роль) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнена роль!";
			Сообщение.Поле = "Назначения[" + Формат(Индекс, "ЧГ=0") + "].Роль";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;

		// Проверка Процента
		Если СтрТЧ.ПроцентЗанятости <= 0 Или СтрТЧ.ПроцентЗанятости > 100 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Процент должен быть от 1 до 100!";
			Сообщение.Поле = "Назначения[" + Формат(Индекс, "ЧГ=0") + "].ПроцентЗанятости";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		Иначе
			СуммаПроцентовДокумента = СуммаПроцентовДокумента + СтрТЧ.ПроцентЗанятости;
		КонецЕсли;

		Индекс = Индекс + 1;

	КонецЦикла;

	// 3. Проверка общей загрузки (если нет грубых ошибок выше)
	Если НЕ Отказ Тогда
		ПроверитьЗагрузкуСотрудника(Отказ, СуммаПроцентовДокумента);
	КонецЕсли;

КонецПроцедуры

// ==========================================
// ПЕРЕД ЗАПИСЬЮ
// ==========================================
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Автозаполнение организации, если пусто
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления";
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			Организация = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// ==========================================
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ
// ==========================================
// ВСПОМОГАТЕЛЬНАЯ ПРОЦЕДУРА
Процедура ПроверитьЗагрузкуСотрудника(Отказ, СуммаПроцентовДокумента)
	
	Если НЕ ЗначениеЗаполнено(Сотрудник) ИЛИ СуммаПроцентовДокумента <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	// ЛОГИКА ЗАПРОСА:
	// 1. Берем полный остаток по сотруднику из виртуальной таблицы (тут замешан и наш документ, если он проведен).
	// 2. Берем движения ИМЕННО ЭТОГО документа (по Регистратору) из физической таблицы.
	// 3. Вычитаем (2) из (1). Получаем "Чистый остаток от других документов".
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВложенныйЗапрос.Загрузка) КАК ТекущаяЗагрузка
	|ИЗ
	|	(
	|		// 1. Общий остаток по всем документам (включая этот)
	|		ВЫБРАТЬ
	|			ЕСТЬNULL(Остатки.ПроцентЗанятостиОстаток, 0) КАК Загрузка
	|		ИЗ
	|			РегистрНакопления.ИТСервисы_ДвижениеРесурсовСервисов.Остатки(
	|				&ДатаНачала,
	|				Сотрудник = &Сотрудник
	|			) КАК Остатки
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		// 2. Минусуем движения текущего документа (чтобы обнулить его вклад)
	|		ВЫБРАТЬ
	|			-ЕСТЬNULL(Движения.ПроцентЗанятости, 0)
	|		ИЗ
	|			РегистрНакопления.ИТСервисы_ДвижениеРесурсовСервисов КАК Движения
	|		ГДЕ
	|			Движения.Регистратор = &Ссылка
	|			И Движения.Период <= &ДатаНачала
	|			И Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			И Движения.Активность = ИСТИНА
	|	) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	ТекущаяЗагрузкаБазы = 0;
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		// Если результат NULL (например, сотрудник новый), превращаем в 0
		Если Выборка.ТекущаяЗагрузка <> NULL Тогда
			ТекущаяЗагрузкаБазы = Выборка.ТекущаяЗагрузка;
		КонецЕсли;
	КонецЕсли;
	
	ОбщаяЗагрузка = ТекущаяЗагрузкаБазы + СуммаПроцентовДокумента;
	
	Если ОбщаяЗагрузка > 100 Тогда
		
		ТекстСообщения = СтрШаблон(
			"Внимание! Сотрудник %1 перегружен. Итого: %2%% (Было занято другими: %3%% + Этот договор: %4%%).",
			Сотрудник,
			ОбщаяЗагрузка,
			ТекущаяЗагрузкаБазы,
			СуммаПроцентовДокумента
		);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Поле = "Сотрудник"; 
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		
	КонецЕсли;

КонецПроцедуры
